// Задание 1
Console.Clear ();
Console.Write("Введите число:");
int a = Convert.ToInt32(Console.ReadLine());
if (a % 7 == 0 && a % 23 == 0)

Console.WriteLine("Число кратно");

else

Console.WriteLine("Число не кратно");